Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: Teen
ha: Matasa

source: Terms of Use
ha: Sharuɗɗa da za'a yi amfani da su

source: Thanks for signing up!
ha: Mun gode da ka yi rijista!

source: Thank you for purchasing
ha: Mun gode da siyayyarka

source: The category you requested does not exist.
ha: Jinsin da ka nema ba ya samuwa.

source: The next time you start the Firefox Marketplace app, you’ll see the updated version!
ha: Lokaci na gaba da ka kunna aikace-aikacen Marketplace na Firefox, za ka ga sabon yayin!

source: There was an error submitting your newsletter sign up request
ha: Akwai kuskure wajen aika neman yin rijista domin wasiƙar labarai

source: There was a problem submitting your feedback. Try again soon.
ha: Akwai matsala wajen aikawa da amsarka. Sake gwadawa ba da daɗewa ba.

source: This app has no reviews.
ha: Wannan aikin ba shi da nazari

source: This review has been successfully deleted
ha: An sami nasarar goge wannan nazarin

source: This review has been successfully flagged. Thanks!
ha: An sami nasarar sakawa wannan nazarin alamar tuta. Godiya!

source: Tool & Time Saver
ha: Kayan aiki & Masu Ajiye Lokaci

source: Travel
ha: Tafiye-tafiye

source: Try again
ha: Sake gwadawa

source: Try Again
ha: Sake gwadawa

source: Unable to install packaged apps
ha: Ya gaza saka tsararrun aikace-aikace

source: Unavailable
ha: Ba'a samu ba

source: Update Review
ha: Sabunta Nazari

source: Updates
ha: Sabuntawa

source: Utilities
ha: Kayayyaki

source: View All
ha: Kalli Duka

source: We want to hear from you!
ha: Muna so mu ji daga gareka!

source: Work & Business App
ha: Aikace-aikace na Aiki & Kasuwanci

source: Write a review
ha: Rubuta nazari

source: Write a Review
ha: Rubuta Nazari

source: Yes, show me recommendations based on my installed apps. <a href="{url}" target="_blank">Learn more</a>
ha: E, nuna min shawarwari a kan aikace-aikacena da na saka. <a href="{url}" target="_blank">Daɗa koyo</a>

source: You have no apps
ha: Ba ka da aikace-aikace

source: You'll receive an email from mozilla@e.mozilla.org, please check your inbox for your first email from us. If you don’t see it, check your spam filter.
ha: Za ka sami imel daga mozilla@e.mozilla.org, duba abin da ke cikin akwatinka domin saƙonka na farko daga garemu. Idan ba ka ganshi ba, duba rariyar tarkace.

source: You must be signed in to view your apps.
ha: Dole ka shiga domin ganin aikace-aikcenka.

source: You must use Firefox to install Firefox apps.
ha: Dole kayi amfani da Firefox domin saka aikace-aikacen Firefox.

source: Your Mac settings may prevent you from installing apps that do not come from the Mac App Store.
ha: Saitunanka na Mac na iya tsareka daga saka aikace-aikace waɗanda basu zo daga Ma'ajiyar Aikace-aikacen Mac ba.

source: Your review was successfully edited
ha: An sani nasara wajen gyara nazarinka

source: Your review was successfully posted. Thanks!
ha: An sami nasara wajen aikawa da nazarinka. Godiya!

source: Your settings have been successfully saved
ha: An sami nasara wajen ajiye saitunanka

source: An error occurred. Close the window to continue
ha: Wani kuskure ya faru. Rufe window domin ci gaba

source: An error occurred whilst trying to log out.
ha: Kuskure ya afku yayin ƙoƙarin fita.

source: An internal web request timed out.
ha: Lokacin nema na yanar gizo na ciki ya wuce.

source: An unexpected error occurred.
ha: Kuskuren da ba'a zata ba ya afku.

source: An unexpected error occurred when creating your PIN.
ha: Wani kuskure da ba'a zata ba ya afku lokacin ƙirƙirar PIN ɗinka.

source: An unexpected error occurred when resetting your PIN.
ha: Wani kuskure da ba'a zata ba ya afku lokacin sake saita PIN ɗinka.

source: An unexpected error occurred whilst checking your PIN.
ha: Wani kuskure da ba'a zata ba ya afku yayin duba PIN ɗinka.

source: Are you sure you want to reset your PIN? You must sign in to Firefox Accounts to reset your PIN.
ha: Ka tabbatar ka na so ka sake saita PIN ɗinka? Dole ka shiga cikin Asusun Firefox domin sake saita PIN ɗinka.

source: Are you sure you want to reset your PIN? You must sign in to Persona to reset your PIN.
ha: Ka tabbata ka na so ka sake saita PIN ɗinka? Dole ka shiga zuwa na Ƙashin kai domin sake saita PIN ɗinka.

source: Beginning payment
ha: Fara biya

source: By proceeding you agree to our <a %(terms)s>terms</a> and <a %(privacy)s>Privacy Policy</a>
ha: Ta ci gaba ka yarda da <a %(terms)s>terms</a> da <a %(privacy)s>Privacy Policy</a>

source: Completing payment
ha: Cika biya

source: Completing Payment
ha: Ana gama Biyan

source: Confirm PIN
ha: Tabbatar da PIN

source: Connecting to Firefox Accounts
ha: Haɗawa da Asusun Firefox

source: Connecting to Persona
ha: Haɗawa da na Ƙashin kai

source: Create a PIN
ha: Ƙirƙiri PIN

source: Create PIN
ha: Ƙirƙiri PIN

source: Enter PIN
ha: Shigar da PIN

source: Error
ha: Kuskure

source: Forgot your PIN?
ha: Ka manta PIN naka

source: Initializing
ha: Yana farawa

source: Loading
ha: Lodawa

source: Logging out
ha: Fita

source: No network simulation
ha: Babu haɗin canjawa

source: Not you?
ha: Ba kai ba ne?

source: No valid user found whilst attempting to create your PIN
ha: Ba'a sami mai amfani ingantacce ba yayin yinƙurin ƙirƙirar PIN

source: No valid user found whilst attempting to reset your PIN
ha: Ba'a sami mai amfani ingantacce ba yayin yinƙurin sake saita PIN ɗinka

source: No valid user found whilst checking your PIN
ha: Ba'a sami mai amfani ingantacce ba yayin duba PIN ɗinka

source: Oops
ha: Kash

source: Payment complete
ha: An kammala biya

source: Payments are temporarily disabled.
ha: An kashe biya na wani taƙaitaccen lokaci.

source: Permission denied attempting to check your PIN
ha: An hana izini a yinƙurin duba PIN ɗinka.

source: Permission denied attempting to create your PIN.
ha: An hana izini na yinƙurin ƙirƙirar PIN ɗinka.

source: Permission denied attempting to reset your PIN.
ha: An hana izini a yinƙurin sake saita PIN ɗinka.

source: PIN can only contain digits.
ha: PIN zai iya ɗaukar haruffa ne kawai

source: PIN Locked
ha: An rufe PIN

source: PINs do not match.
ha: PINs ba su dace ba.

source: PIN too short
ha: PIN ya cika gajarta

source: Please sign in to reset your PIN.
ha: Shiga domin sake saita PIN ɗinka.

source: Processing
ha: Aiwatarwa

source: Product cannot be purchased due to configuration error.
ha: Ba za'a iya sayen kayan ba sabo da kuskuren saitawa.

source: Reset
ha: Sake saitawa

source: Reset PIN
ha: Sake saita PIN

source: Reset your PIN?
ha: A sake saita PIN ɗinka?

source: Retrieving Transaction
ha: Dawo da Harkar Siyayya

source: Retry?
ha: Sake gwadawa?

source: Retrying
ha: Sake gwadawa

source: Setting up payment
ha: Saita biya

source: Sign in
ha: Shiga

source: Sign in to continue with the payment
ha: Shiga domin ci gaba da biyan

source: Sign-in to reset PIN
ha: Shiga domin sake saita PIN

source: Simulate Payment
ha: Canja Biya

source: Simulate Something?
ha: Canja Wani abu?

source: Something went wrong.
ha: Wani abu ya tafi ba dai dai ba.

source: Something went wrong. Try again?
ha: Wani abu ya tafi ba dai dai ba. Sake gwadawa?

source: Super Simulate
ha: Babbar Canjawa

source: That took longer than expected. Retry?
ha: Wannan ya ɗauki lokacin da ba'a zata ba. Sake gwadawa?

source: The payment method or price point is not supported for this region or operator.
ha: Yadda ake biya ko gurbin farashin ba shi da tallafi a wannan nahiyar ko mai gudanarwa.

source: The PIN data submitted was invalid.
ha: Bayanin PIN da aka miƙa ba ingantacce ba ne.

source: The request timed out whilst attempting to create your PIN.
ha: Lokacin nema ya wuce yayin yinƙurin ƙirƙirar PIN ɗinka.

source: The request timed out whilst attempting to reset your PIN.
ha: Lokacin nema ya wuce yayin yinƙurin sake saita PIN ɗinka.

source: The request timed out whilst trying to check your PIN
ha: Lokacin nema ya wuce yayin ƙoƙarin duba PIN ɗinka

source: The system timed out while trying to log in.
ha: Lokacin kwamfuta ya wuce yayin ƙoƙarin shiga.

source: The system timed out while trying to log out.
ha: Lokacin kwamfuta ya wuce yayin ƙoƙarin fita.

source: The transaction failed. You have not been charged for this purchase.
ha: Harkar ta ci tura. Ba'a cajeka kuɗin wannan siyayyar ba.

source: This is taking longer than expected. Try again?
ha: Wannan ya ɗauki tsawon lokacin da ba'a zata ba. Sake gwadawa?

source: Verifying payment
ha: Tantance biya

source: Waiting for login
ha: Jira domin shiga

source: Was Locked
ha: An Rufe

source: Wrong PIN
ha: PIN bai yi dai dai ba

source: You are signed in as:
ha: Ka shiga a matsayin:

source: You entered the wrong PIN too many times. Your account is locked. Please try your purchase again in 5 minutes.
ha: Ka shigar da PIN ba dai dai sau da yawa. An rufe asusunka. Gwada sake sayenka a mintina 5.

source: You logged in as a different user, you must start the payment again.
ha: Ka shiga a matsayin wani mai amfani daban, dole ka fara sake biya.

source: Your PIN was locked
ha: An rufe PIN naka

source: Your PIN was locked because you entered it incorrectly too many times. You can continue and try entering your PIN again or reset your PIN.
ha: An rufe asusunka sabo da ka shigar da shi ba dai dai ba sau da dama. Za ka iya ci gaba kuma ka gwada sake shigar da PIN ko ka sake saita PIN ɗinka.

source: Your purchase is complete. Close the window to continue
ha: Siyayyarka ta kammala. Rufe window domin ci gaba

source: You will not be charged.
ha: Ba za'a cajeka ba.

source: {0} and {1} other replied
ha: {0} da {1} wani ya amsa

source: {0} answer
ha: Amsa {0}

source: {0} documents
ha: Daftarori {0}

source: {0} question
ha: tambayoyi {0}

source: {0} replied
ha: {0} ya amsa

source: {0} solution
ha: Mafita {0}

source: 1 article can be viewed by 400 million users and translated into 70+ languages
ha: Maƙala 1 masu amfani miliyan 400 za su iya gani kuma an fassara zuwa yaruka 70+

source: 1m
ha: m1

source: 1 new this week
ha: Sabo 1 a wannan mako

source: 1 person has this problem
ha: Mutum 1 ya na da wannan matsalar

source: 1 post
ha: aike-aike {0}

source: 1 reply
ha: Amsoshi {n}

source: 1 tweet can save 1 day
ha: Tweet 1 na iya ceto rana 1

source: 1y
ha: y1

source: 2008 L10n Badge
ha: Bajon L10N 2008

source: 2009 L10n Badge
ha: Bajon L10n 2009

source: 2010 Army of Awesome Badge
ha: Bajon Rundunar Burgewa 2010

source: 2010 KB Badge
ha: Bajon KB 2010

source: 2010 L10n Badge
ha: Bajon L10n 2010

source: 2010 Support Forum Badge
ha: Bajon Dandalin Tallafi 2010

source: 2011 Army of Awesome Badge
ha: Bajon Rundunar Burgewa 2011

source: 2011 KB Badge
ha: Bajon KB 2011

source: 2011 L10n Badge
ha: Bajon L10n 2011

source: 2011 Support Forum Badge
ha: Bajon Dandalin Tallafi 2011

source: 2012 Army of Awesome Badge
ha: Bajon Rundunar Burgewa 2012

source: 2012 KB Badge
ha: Bajon KB 2012

source: 2012 L10n Badge
ha: Bajon L10n 2012

source: 2012 Support Forum Badge
ha: Bajon Dandalin Tallafi 2012

source: 2013 Army of Awesome Badge
ha: Bajon Rundunar Burgewa 2013

source: 2013 KB Badge
ha: Bajon KB 2013

source: 2013 L10n Badge
ha: Bajon L10n 2013

source: 2013 Support Forum Badge
ha: Bajon Dandalin Tallafi 2013

source: 2014 Army of Awesome Badge
ha: Bajon Rundunar Burgewa 2014

source: 2014 KB Badge
ha: Bajon KB 2014

source: 2014 L10n Badge
ha: Bajon L10n 2014

source: 2014 Support Forum Badge
ha: Bajon Dandalin Tallafi 2014

source: 2015 Army of Awesome Badge
ha: Bajon Rundunar Burgewa na 2015

source: 2015 KB Badge
ha: Bajon KB 2015

source: 2015 L10n Badge
ha: Bajon L10n 2015

source: 2015 Support Forum Badge
ha: Bajo na Ƙungiyar Tallafi 2015

source: 3m
ha: m3

source: 6m
ha: m6

source: About Us
ha: Dangane da Mu

source: About {user}
ha: Dangane da {user}

source: Abusive content
ha: Abin ciki wanda bai dace ba

source: Accept
ha: Karɓi

source: Accepted and Fixed
ha: An karɓa kuma an gyara

source: Accepted formats include: PNG, JPEG, GIF. <a target="_blank" href="{learn_more}">Learn more...</a>
ha: Tsarin da aka amince da shi ya haɗa da: PNG, JPEG, GIF. <a target="_blank" href="{learn_more}">Daɗa koyo...</a>

source: Accept this Revision
ha: Karɓi wannan Nazarin

source: Accept this Translation
ha: Karɓi wannan Fassarar

source: Access and organize your favorite webpages easily with bookmarks and tabs
ha: Sami dama da shirya shafukan yanar gizo da ka fi so cikin sauƙi tare da zaunanniyar alama da madannai

source: Access denied
ha: An hana dama

source: Access websites easily with bookmarks and tab features
ha: Sami damar shiga cikin sauƙi tare da zaunanniyar alama da kamanni na madannai

source: Account Administration
ha: Gudanar da Asusu

source: Account already activated
ha: Tuni an farfaɗo da asusu

source: Account banned successfully!
ha: An sami nasarar haramta asusu!

source: Account is now being ignored!
ha: A yanzu ana watsi da asusu!

source: Account Issues
ha: Batutuwan Asusu

source: Account successfully verified!
ha: An sami nasarar tantance asusu!

source: A confirmation email will be sent to this address in order to post your question.
ha: Za'a aika imel na tabbatarwa zuwa wannan adireshin domin aikawa da tambayarka.

source: activation key
ha: mabuɗin farfaɗowa

source: Active Contributors
ha: Masu bayar da Gudun mawa Masu aiki

source: Add
ha: Daɗa

source: Add and configure your email accounts on Thunderbird
ha: Daɗa kuma ka saita asusunka na imel a kan Thunderbird

source: Add announcement
ha: Daɗa sanarwa

source: Add Contributor
ha: Daɗa Mai bayar da gudun mawa

source: Add Editor
ha: Daɗa Masu gyara

source: Add group profile
ha: Daɗa tarihin ƙungiya

source: Add images:
ha: Daɗa hotuna:

source: Additional System Details
ha: Ƙarin Cikakken Bayanin Na'ura

source: Add Leader
ha: Daɗa Jagora

source: Add Member
ha: Daɗa Mamba

source: Add Reviewer
ha: Daɗa Mai Nazari

source: Administration
ha: Gudanarwa

source: Administrator
ha: Mai tafiyarwa

source: A document with this slug already exists in this locale.
ha: Tuni akwai takarda mai wannan tsarin a wannan wurin.

source: A document with this title already exists in this locale.
ha: Tuni akwai takarda mai wannan suna a wannan wurin.

source: Advanced Search
ha: Nemi mai zurfi

source: Advanced Search Results
ha: Sakamakon Nema mai Zurfi

source: A few times a week
ha: Lokuta kaɗan a mako

source: Affects search results
ha: Ya shafi sakamakon bincike

source: After
ha: Bayan

source: A fully translated user interface improves the experience for site visitors in your language. Help <a href="%(url)s">translate the interface</a>.
ha: Cikakkiyar mashigar mai amfani da aka fassara kan haɓaka koyo domin masu ziyarar dandali a yarenka. Taimaka <a href="%(url)s">fassara mashigar</a>.

source: Aggregated Localization Metrics
ha: Jimlatattun Lambobin da aka Fassara

source: Aggregated Metrics
ha: Jimlatattun Lambobi

source: <a href="{reply_url}">last reply</a> by <a href="{user_url}">{username}</a> {when}
ha: <a href="{reply_url}">amsar ƙarshe</a> daga <a href="{user_url}">{username}</a> {when}

source: <a href="%(thread_url)s">%(thread_title)s</a><br> in <a href="%(document_discussion_url)s">%(document)s</a>
ha: <a href="%(thread_url)s">%(thread_title)s</a><br> cikin <a href="%(document_discussion_url)s">%(document)s</a>

source: <a href="%(url)s">Forum Contributor</a> - Answer user support questions that are most-requested but have no replies.
ha: <a href="%(url)s">Mai bayar da gudun mawa ga Dandali</a> - Amsa tambayoyin tallafi na mai amfani waɗanda aka fi nema amma ba su da amsa.

source: <a href="%(url)s">KB Editor</a> - Help to update knowledge base articles that need changes or write new articles.
ha: <a href="%(url)s">Mai gyare-gyare na KB</a> - Taimaka wajen sabunta maƙalolin tushen ilimi da ke bukatar canje-canje ko ka rubuta sababbin maƙaloli.

source: <a href="%(url)s">L10N Contributor</a> - Help to translate Firefox Help content to your language.
ha: <a href="%(url)s">Mai bayar da Gudun mawa na L10N</a> - Taimaka wajen fassara abubuwan ciki na Taimakon Firefox zuwa yarenka.

source: <a href="%(url)s">Twitter Contributor</a> - Respond to tweets about Firefox.
ha: <a href="%(url)s">Mai bayar da Gudun mawa na Twitter</a> - Bayar da amsa ga dangane da Firefox.

source: algorithm
ha: hanyar warware matsala

source: All Administration articles...
ha: Duk maƙalolin gudanarwa...

source: All Articles
ha: Duk Maƙaloli

source: All articles requiring review...
ha: Duk maƙalolin da ke bukatar nazari...

source: All articles that require changes...
ha: Duk maƙaloli masu bakatar canje-canje...

source: All articles with changes not ready for localization...
ha: Duk maƙaloli masu canje-canje da ba su shirya domin fassara ba...

source: All available SUMO badges
ha: Duk bajojin SUMO da ake da su

source: All canned responses articles...
ha: Duk maƙaloli na shiryayyun amsoshi...

source: All How To Contribute articles...
ha: Duk Yadda Za ka Bayar da Gudun mawar maƙaloli...

source: All knowledge base articles...
ha: Dukkan maƙaloli masu tushen ilimi...

source: All Knowledge Base Articles
ha: Dukkan Maƙaloli Masu Tushen Ilimi

source: All locales
ha: Duk wurare

source: Allow discussion on this article?
ha: A bar tattaunawa kan wannan maƙala?

source: Allow translations:
ha: Bar fassarori:

source: All posts
ha: Duk aike-aike

source: All products
ha: Duk kayayyaki

source: All Products
ha: Duk Kayayyaki

source: All questions
ha: Duk tambayoyi

source: All templates...
ha: Duk allon misali...

source: All Time
ha: Duk lokaci

source: All Topics
ha: Duk Batutuwa

source: All translations...
ha: Duk fassarori...

source: All translations of this document will also be deleted.
ha: Duk fassarorin wannan daftarin za'a gogesu.

source: All unhelpful articles...
ha: Duk maƙaloli marasa taimakawa...

source: Almost there! We just need you to create a support forum account!
ha: Ka kusa! Kawai muna so ka ƙirƙiri asusu na tallafin ƙungiya!

source: Already have an account? Sign in
ha: Tuni kana da asusu? Shiga

source: An email has been sent to the address below:
ha: An aika da saƙon imel zuwa adireshin ƙasa:

source: An error occured.
ha: Kuskure ya afku.

source: An error occured: {message}
ha: Kuskure ya afku: {message}

source: An Error Occurred
ha: Kuskure ya Afku

source: A newer revision has already been reviewed.
ha: Tuni aka sake duba sabon nazarinka.

source: A newer version has already been reviewed.
ha: Tuni aka sake duba sabon nazarinka.

source: A new online standard to recognize and verify learning
ha: Sabon matsayi na kan yanar gizo domin ganowa da tantance koyo

source: A new window will open. Click on a button called <em>Copy text to clipboard</em>.
ha: Wata taga za ta buɗe. Danna wani madanni da ake kira <em>Kwafi rubutun zuwa allon maƙalawa</em>.

source: Answered
ha: Wanda aka amsa

source: answered by <a href="{user_url}">{username}</a> {when}
ha: an amsa daga <a href="{user_url}">{username}</a> {when}

source: {answerer} commented on a Firefox question on {host}:
ha: {answerer} an yi sharhi a kan tambayar Firefox a {host}:

source: {answerer} has posted an answer to your question on {host}:
ha: {answerer} ya aika da amsa zuwa ga tambayarka a {host}:

source: {answerer} wrote:
ha: {answerer} ya rubuta:

source: Answer questions in the forum
ha: Amsa tambaya a dandalin

source: Answer questions in the support forum
ha: Amsa tambayoyi a dandalin tallafi

source: Answers didn't help
ha: Amsoshi basu taimaka ba

source: Answer to Twitter users that need help. It's super easy with our canned responses.
ha: Amsa ga masu amfani da Twitter masu bukatar taimako. Yana da matuƙar sauƙi tare da shiryayyun amsoshi.

source: Answer Votes: % Helpful
ha: Ƙuri'un amsoshi: % Masu taimakawa

source: Application
ha: Aikace-aikace

source: Application Issues
ha: Matsalolin aikace-aikace

source: Applications
ha: Aikace-aikace

source: Approved
ha: An amince

source: Approved {default_locale} version:
ha: Yayin {default_locale} da aka amince da shi:

source: Approve Revision
ha: Amince da Nazari

source: Approve Translation
ha: Amince da Fassara

source: Archived
ha: Ajiyayyu

source: Archive this question
ha: Ajiye wannan tambaya

source: A request was received to reset the password for this account on %(sitename)s. To change this password please click on the following link, or paste it into your browser's location bar:
ha: An sami nema na a saita kalmar wucewa domin wannan asusu a %(sitename)s. Domin canja wannan kalmar wucewa danna mahaɗin da ke tafe, ko ka liƙa a wurin sandar mai gewayawa:

source: A revision must be based on the English article. Revision ID %(id)s does not fit this criterion.
ha: Dole nazari ya zama a kan maƙalar Turanci. ID na nazari %(id)s bai dace da wannan tsari ba.

source: A revision you contributed to has been approved. %(reviewer)s has approved a revision to the document %(document_title)s.
ha: Nazarin da ka bayar da gudun mawa an amince da shi. %(reviewer)s sun amince da nazarinka na daftari %(document_title)s.

source: A revision you contributed to has been approved: {title}
ha: An amince da nazarin da ka bayar da gudun mawa: {title}

source: A revision you contributed to has been reviewed. %(reviewer)s has reviewed a revision to the document %(document_title)s.
ha: An duba nazarin da ka bayar da gudun mawa. %(reviewer)s sun duba nazarin na daftari %(document_title)s.

source: A revision you contributed to has been reviewed: {title}
ha: An sake nazari a kan nazarin da ka bayar da gudun mawa: {title}

source: Are you registered with Mozilla Support?
ha: Ka yi rijista da Tallafin Mozilla?

source: Are you sure
ha: Ka tabbata

source: Are you sure you want to delete the {group} group avatar?
ha: Ka tabbata kana so ka goge {group} hoton ƙungiya?

source: Are you sure you want to delete these messages?
ha: Ka tabbata kana so ka goge waɗan nan saƙwannin?

source: Are you sure you want to delete this answer?
ha: Ka tabbata kana so ka goge wannan amsa?

source: Are you sure you want to delete this document?
ha: Ka tabbata ka na so ka goge wannan daftari?

source: Are you sure you want to delete this image?
ha: Ka tabbata kana so ka goge wannan hoto?

source: Are you sure you want to delete this message?
ha: Ka tabbata kana so ka goge wannan saƙon?

source: Are you sure you want to delete this post?
ha: Ka tabbata ka na so ka goge wannan aiken?

source: Are you sure you want to delete this question?
ha: Ka tabbata kana so ka goge wannan tambaya?

source: Are you sure you want to delete this revision?
ha: Ka tabbata ka na so ka goge wannan nazarin?

source: Are you sure you want to delete this thread?
ha: Ka tabbata kana so ka goge wannan tattaunawa?

source: Are you sure you want to delete this video?
ha: Ka tabbata ka na so ka goge wannan bidiyo?

source: Are you sure you want to delete your avatar?
ha: Ka tabbatar kana so ka goge hotonka?

source: Are you sure you want to remove {user}?
ha: Ka tabbata ka na so ka cire {user}?

source: Are you sure you want to remove {user} from {group}?
ha: Ka tabbata kana so ka cire {user} daga {group}?

source: Are you sure you want to remove {user} from {group} leaders?
ha: Ka tabbata kana so ka cire {user} daga {group} jagorori?

source: Are you sure you want to remove {user} from the document contributors?
ha: Ka tabbata ka na so ka cire {user} daga masu bayar da gudun mawa?

source: Are you sure you want to unsubscribe?
ha: Ka tabbata ka na so ka daina sautu?

source: Army of Awesome
ha: Rundunar Burgewa

source: Army Of Awesome
ha: Rundunar Burgewa

source: Army of Awesome: help users on Twitter
ha: Rundunar Burgewa: taimakawa masu amfani na Twitter

source: Army of Awesome will never tweet without your permission.
ha: Rundunar Burgewa ba za ta yi tweet ba tare da izininka ba.

source: Article
ha: Maƙala

source: Article contains
ha: Maƙala ta ƙunshi

source: Article Discussions
ha: Maƙalolin Tattaunawa

source: Article is for:
ha: Maƙala domin:
